{
  "title": "IBM Cloud Hyper Protect Crypto Services docs",
  "lastupdated": "2022-04-11",
  "introduction": "Find useful information about Hyper Protect Crypto Services.",
  "section_devtools": {
    "api": "/docs?tab=api-docs&category=security&subCategory=hs-crypto",
    "cli": "/docs/hs-crypto?topic=hs-crypto-cli-plugin-hpcs-cli-plugin",
    "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/hpcs"
  },
  "section_recommended": [
    {
      "title": "Initialize service instances using smart cards and the Management Utilities",
      "description": "This approach gives you the highest security, which enables you to store and manage master key parts using smart cards.",
      "href": "/docs/hs-crypto?topic=hs-crypto-initialize-hsm-management-utilities"
    },
    {
      "title": "Initialize service instances using recovery crypto units",
      "description": "If you create your service instance in Dallas (us-south) or Washington DC (us-east) where the recovery crypto units are enabled, you can choose this approach where the master key is randomly generated within a recovery crypto unit and then exported to other crypto units.",
      "href": "/docs/hs-crypto?topic=hs-crypto-initialize-hsm-recovery-crypto-unit"
    },
    {
      "title": "Initialize service instances using key part files",
      "description": "You can also initialize your service instance using master key parts that are stored in files on your local workstation. You can use this approach regardless of whether or not your service instance includes recovery crypto units. ",
      "href": "/docs/hs-crypto?topic=hs-crypto-initialize-hsm"
    }
  ],
  "section_videos": [
    {
      "title": "IBM Cloud Hyper Protect Crypto Services overview",
      "href": "https://mediacenter.ibm.com/media/1_zxwh6ixm",
      "thumbnail": "/images/thumbnail_overview_video.png"
    },
    {
      "title": "Initializing Hyper Protect Crypto Services with key parts",
      "href": "https://mediacenter.ibm.com/media/0_z5c589ou",
      "thumbnail": "/images/thumbnail_initialize_cli.png"
    },
    {
      "title": "Initializing Hyper Protect Crypto Services with smart cards",
      "href": "https://mediacenter.ibm.com/media/1_lo2fmwbb",
      "thumbnail": "/images/thumbnail_initialize_smart_card.png"
    },
    {
      "title": "Hyper Protect Crypto Services and KMIP for VMware on IBM Cloud",
      "href": "https://mediacenter.ibm.com/media/0_4wm4bq4s",
      "thumbnail": "/images/thumbnail_vmware_intro.png"
    },
    {
      "title": "Configuring KMIP in Hyper Protect Crypto Services for key management and distribution",
      "href": "https://mediacenter.ibm.com/media/1_e5gk6ktn",
      "thumbnail": "/images/thumbnail_vmware_integration.png"
    },
    {
      "title": "Integrating Cloud Object Storage with Hyper Protect Crypto Services",
      "href": "https://mediacenter.ibm.com/media/0_mgxwp16v",
      "thumbnail": "/images/thumbnail_cos_integration.png"
    }
  ],
  "section_learn": {
    "developer": "https://developer.ibm.com/components/hyper-protect/"
  },
  "section_updates": {
    "view_more": "/docs/hs-crypto?topic=hs-crypto-what-new",
    "tiles": [
      {
        "date": "June 2022",
        "title": "Hyper Protect Crypto Services Unified Key Orchestrator CLI plug-in",
        "description": "With the command-line interface (CLI) support for Hyper Protect Crypto Services with the Unified Key Orchestrator plan, you can now manage vaults, keystores, and keys by using CLI commands."
      }, 
      {
        "date": "February 2022",
        "title": "Limited availability: Using Unified Key Orchestration to manage and orchestrate keys in a multicloud environment",
        "description": "With Unified Key Orchestration, you can connect your service instance to keystores in third-party cloud providers, back up and manage keys using the unified system, and orchestrate keys across multiple clouds."
      },      
      {
        "date": "February 2022",
        "title": "Hyper Protect Crypto Services expands into the Sao-Paulo region",
        "description": "You can now create Hyper Protect Crypto Services instances in the Sao-Paulo (`br-sao`) region where the infrastructure is based on IBM Cloud Virtual Private Cloud (VPC)."
      },
      {
        "date": "January 2022",
        "title": "Hyper Protect Crypto Services key management service API is updated to version `2.82` ",
        "description": "You can now purge a deleted key manually and transfer a key to another keyring using either UI or API."
      }
    ]
  }
}
