{
  "title": "IBM Cloud Hyper Protect Crypto Services docs",
  "lastupdated": "2024-06-05",
  "introduction": "Find useful information about Hyper Protect Crypto Services.",
  "section_devtools": {
    "api": "/docs?tab=api-docs&category=security&subCategory=hs-crypto",
    "cli": "/docs/hs-crypto?topic=hs-crypto-hpcs-cli-plugin",
    "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/hpcs"
  },
  "section_recommended": [
    {
      "title": "Initialize service instances using smart cards and the Management Utilities",
      "description": "This approach gives you the highest security, which enables you to store and manage master key parts using smart cards.",
      "href": "/docs/hs-crypto?topic=hs-crypto-initialize-hsm-management-utilities"
    },
    {
      "title": "Initialize service instances using recovery crypto units",
      "description": "If you create your service instance in supported regions other than Madrid (`eu-es`) with the recovery crypto units are enabled, you can choose this approach where the master key is randomly generated within a recovery crypto unit and then exported to other crypto units.",
      "href": "/docs/hs-crypto?topic=hs-crypto-initialize-hsm-recovery-crypto-unit"
    },
    {
      "title": "Initialize service instances using key part files",
      "description": "You can also initialize your service instance using master key parts that are stored in files on your local workstation. You can use this approach regardless of whether or not your service instance includes recovery crypto units. ",
      "href": "/docs/hs-crypto?topic=hs-crypto-initialize-hsm"
    }
  ],
  "section_videos": [
    {
      "title": "IBM Cloud Hyper Protect Crypto Services overview",
      "href": "https://mediacenter.ibm.com/media/1_1ipwq52p",
      "thumbnail": "/images/thumbnail_overview_video.png"
    },
    {
      "title": "Introducing Hyper Protect Crypto Services with Unified Key Orchestrator",
      "href": "https://mediacenter.ibm.com/media/1_2q05kgh2",
      "thumbnail": "/images/thumbnail_uko_overview.png"
    },
    {
      "title": "Initializing Hyper Protect Crypto Services with key parts",
      "href": "https://mediacenter.ibm.com/media/1_47xngxvg",
      "thumbnail": "/images/thumbnail_initialize_cli.png"
    },
    {
      "title": "Initializing Hyper Protect Crypto Services with smart cards",
      "href": "https://mediacenter.ibm.com/media/1_lo2fmwbb",
      "thumbnail": "/images/thumbnail_initialize_smart_card.png"
    },
    {
      "title": "Managing compliance of a Microsoft Office 365 environment using Hyper Protect Crypto Services with Unified Key Orchestrator",
      "href": "https://mediacenter.ibm.com/media/1_1pzzhrb8",
      "thumbnail": "/images/thumbnail_uko_o365.png"
    },
    {
      "title": "Securely managing AWS S3 encryption keys using Hyper Protect Crypto Services with Unified Key Orchestrator",
      "href": "https://mediacenter.ibm.com/media/1_1a6c6vub",
      "thumbnail": "/images/thumbnail_uko_aws.png"
    },
    {
      "title": "Configuring KMIP in Hyper Protect Crypto Services for key management and distribution",
      "href": "https://mediacenter.ibm.com/media/1_e5gk6ktn",
      "thumbnail": "/images/thumbnail_vmware_integration.png"
    },
    {
      "title": "Hyper Protect Crypto Services and KMIP for VMware on IBM Cloud",
      "href": "https://mediacenter.ibm.com/media/0_4wm4bq4s",
      "thumbnail": "/images/thumbnail_vmware_intro.png"
    },
    {
      "title": "Integrating Cloud Object Storage with Hyper Protect Crypto Services",
      "href": "https://mediacenter.ibm.com/media/1_jk65kz0z",
      "thumbnail": "/images/thumbnail_cos_integration.png"
    }
  ],
  "section_learn": {
    "developer": "https://developer.ibm.com/components/hyper-protect/"
  },
  "section_updates": {
    "view_more": "/docs/hs-crypto?topic=hs-crypto-what-new",
    "tiles": [
      {
        "date": "June 2024",
        "title": "Added: New API endpoints for existing service instances",
        "description": "Hyper Protect Crypto Services is continuously replacing port-based API endpoints with instance-based API endpoints. For example, for public key management endpoint URLs, the format is changed from `api.<region>.hs-crypto.cloud.ibm.com:<port>` to `<instance_ID>.api.<region>.hs-crypto.appdomain.cloud`."
      },
      {
        "date": "January 2024",
        "title": "Added: Hyper Protect Crypto Services adds support for Azure software-protected key",
        "description": "Besides HSM-protected keys, software-protected keys can now also be created in Azure Key Vault (Premium) keystores of {{site.data.keyword.uko_full_notm}}. However, you can still create and distribute only software-protected keys to Azure Key Vault (Standard). "
      },
      {
        "date": "Nov 2023",
        "title": "Added: Hyper Protect Crypto Services adds support for Bring Your Own HSM (BYOHSM)",
        "description": "BYOHSM extends your local key management capability to the cloud and creates a scalable, unified, and secure hybrid cloud ecosystem for your regulated workloads."
      },
      {
        "date": "Oct 2023",
        "title": "Deprecated: Hyper Protect Crypto Services in Sydney",
        "description": "New instances of Hyper Protect Crypto Services can no longer be deployed in the IBM Cloud data center in `Sydney` after **30 November 2023**, and existing Hyper Protect Crypto Services instances and support in the IBM Cloud data center in Sydney will be decommissioned and discontinued on 31 March 2024. "
      },
      {
        "date": "Sept 2023",
        "title": "Added: Hyper Protect Crypto Services expands to the Madrid region",
        "description": "You can now create Hyper Protect Crypto Services instances in the Madrid (`eu-es`) region where the infrastructure is based on IBM Cloud Virtual Private Cloud (VPC). "
      }
    ]
  }
}
